#include <stdio.h>

int main() {
    int i=1;

        do {
            printf("%d ", i);
            i++;
            if (i == 6) {
                i++;
                continue;
            }
        } while (i <= 10);

return 0;
}
/* กรณี for จะเป็นการระบุค่าตัวแปร;ค่าเงื่อนไขเเละ;ค่า update อยู่เลยในบรรทัดเดียว จากนั้นจะเป็นการเช็ค ตามเงื่อนไข if ว่าถ้า i เท่ากับ 6 หรือไม่ 
และ จะบวกค่า i+1 จะข้าม continue ไป loop รอบถัดไปเลย

กรณีการใช้ while จะเป็นการระบุเงื่อนไขเเละตัวแปรแยกกันเเละจากนั้นจะเข้า loop เเละเข้าตามเงื่อนไข if เมื่อ i=6 
เเต่โดยรวมจะเป็นการทำงานคล้ายกับ for loop เเต่จะยืดหยุ่นมากกว่าในกรณีที่ไม่รู้ค่าเริ่มตั้นเเละสิ้นสุดที่แน่นอน

กรณีการใช้ do while จะเป็นการทำตามเงื่อนไขก่อน 1 ครั้ง จากนั้นจึงค่อยเช็คว่าตามเงื่อนไขรึป่าว โดยเมื่อ i เท่ากับ 6 จะเป็นการเข้าตามเงื่อนไข if เเละ
จะบวกค่า i ทำให้ i ทำกับ 7 เเละ continue skip การเเสดงค่า 6 เพื่อไป loop ต่อไป




สรุปผล ทั้ง 3 แบบสามารถทำให้แสดงผลได้เหมือนกับเเต่จะเขียนในเเบบที่เเตกต่างกัน ซึงทั้งสามเเบบจะมีคุณสมบัติหรือข้อเด่นที่เเตกต่างกันตามข้อความข้างต้น 
ขึ้นอยู่กับการใช้งาน*/